; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p2-0 - location
	p2-1 - location
	p3-0 - location
	p3-2 - location
	p3-4 - location
	p4-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s4)
	(at package2 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver3 s1)
	(at truck1 s4)
	(at truck3 s3)
	(at package1 s2)
	(at package2 s4)
	))


)

; plan
1. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   goals met: 1 of 5
2. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   goals met: 1 of 5
3. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 1 of 5
4. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 1 of 5
5. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 5
6. (drive-truck truck3 s0 s4 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 1 of 5
7. (load-truck package1 truck3 s4)
   deleted: (at package1 s4)
   added: (in package1 truck3)
   goals met: 1 of 5
8. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 1 of 5
9. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   goals met: 2 of 5
10. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 3 of 5
11. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 5
12. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 4 of 5
13. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 4 of 5
14. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 5 of 5
